[
  {
    "name": "Pair Script",
    "url": "https://github.com/amyeleek/cf-pair-script",
    "frag": "/projects/pair-script",
    "category": "web development",
    "startDate": "2016-03-28",
    "finDate": "",
    "description": "<p>A simple sript for pairing up students at Code Fellows. Pair programming is heavily emphisized, and as TAs we wanted to make our job easier by writing a script.</p><p>Students are loaded from JSON and paired according to a simple algorithm that uses recursion. Then the pairs are displayed on the page. Quick and easy to use, this is going to be a big help for us.</p>"  },
  {
    "name": "Hoofit",
    "url": "https://github.com/SeleniumK/hoofit",
    "frag": "/projects/hoofit",
    "category": "web development",
    "startDate": "2016-01-25",
    "finDate": "2016-02-08",
    "description": "<p>Hoofit is an app designed to help people, especially the visually-impaired, get around Seattle by walking. It features route mapping through Google Maps with warnings for missing sidewalks and representations of accessible signals, as well as destinations of interest in a walkable radius around a given point.</p><p>Created as a final project for Codefellows 301, development on this continues. Planned upgrades include Spanish language options, better route warnings, and more sets of data.</p>"
  },
  {
    "name": "Portfolio",
    "url": "https://github.com/amyeleek/code-portfolio",
    "frag": "/projects/portfolio",
    "category": "web development",
    "startDate": "2016-01-04",
    "finDate": "2016-01-22",
    "description": "<p>This very web page!</p><p>I created this page as part of the CodeFellows 301 course. Everything you see here was created by me, under guidance of my instructors.</p><p>This page  uses AJAX to load these projects, responsive web design to be viewable on as many devices as possible, and jQuery and CSS3 for the visuals. Clever, huh?</p>"
  },
  {
    "name": "Time Parallax",
    "url": "https://github.com/amyeleek/TimeParallax",
    "frag": "/projects/time",
    "category": "animations",
    "startDate": "2015-06-08",
    "finDate": "2015-06-10",
    "description": "<p>A quick set of animation experiments. I fiddled around with jQuery and CSS3 animations to create a view of the Epoch from Chrono Trigger flying over Guardia, with birds and randomized clouds.</p><p>All art assets copyright Squaresoft, Square-Enix.</p>"
  },
  {
    "name": "Knit Chart",
    "url": "https://github.com/amyeleek/KnitChart",
    "frag": "/projects/knit",
    "category": "web development",
    "startDate": "2014-10-08",
    "finDate": "2014-10-27",
    "description": "<p>My first attempt to teach myself some OO Javascript and more use of jQuery. It's pretty rough, but that's what happens when you're just starting out.</p><p>The idea was to create a small knit charter program for Fair Isle designs and lace. It features drag-and-droppable icons, color-changing, a user-defined grid, and printing.</p>"
  }
]
